# Задача 2 к первому занятию
t = int(input('Введите время в секундах: '))
h = t // 3600
m = (t - h * 3600) // 60
s = t - h * 3600 - m * 60
if h < 10:
    h = '0' + str(h)
else:
    h = str(h)
if m < 10:
    m = '0' + str(m)
else:
    m = str(m)
if s < 10:
    s = '0' + str(s)
print('Распределим время в секундах на')
print("%-9s %-12s %-s" % ('часы', 'минуты', 'секунды'))
print('{:<11} {:<12} {:<}'.format(h + ':', m + ':', s))
